Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: རང་གི་ལག་ནས་བཟའ་བ་དང་བཅའ་བ་གཙང་མ་བཟང་པོ་མང་པོ་རྣམ་གྲངས་དུ་མས་ཚིམ་པར་བྱས་ཏེ་ཅི་བཞེད་པ་བསྟབས་ནས། བཅོམ་ལྡན་འདས་བཤོས་གསོལ་ཟིན་ཏེ། གསང་སྡེར་ནི་གྱུ་ཕྱག་ནི་བཅབས་པར་རིག་ནས། སྟན་ཆེས་དམའ་བ་ཞིག་བླངས་ཏེ་ཆོས་མཉན་པའི་ཕྱིར་སྤྱན་སྔར་འདུག་གོ། །
en: Having by their own hands contented the Buddha and the saṅgha of monks with many good, wholesome foods, proffering all that they wished, once the householder, his sons, and his servants knew that they had finished eating, that their bowls had been taken away and their hands washed, they brought in very low seats and sat before the Blessed One to listen to the Dharma.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཁྱིམ་བདག་དེ་བུ་དང་འཁོར་དང་བཅས་པའི་བསམ་པ་དང་བག་ལ་ཉལ་དང་ཁམས་དང་ཤེས་པ་དང་རང་བཞིན་ཐུགས་སུ་ཆུད་ནས་དེ་དང་འཐུན་པའི་ཆོས་བསྟན་ཏེ
en: Then the Blessed One, directly apprehending the thoughts, habitual tendencies, temperament, capacity, and nature of the householder, his sons, and his servants, taught them the Dharma accordingly.

source: དེས་ན་ཁྱིམ་བདག་དེ་བུ་དང་འཁོར་དང་བཅས་པས་སྟན་དེ་ཉིད་ལ་འདུག་བཞིན་དུ། འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩེ་མོ་མཐོན་པོ་ཉི་ཤུ་ཡེ་ཤེས་རྡོ་རྗེས་བཅོམ་ནས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་ཏེ་
en: Upon hearing it, they destroyed with the thunderbolt of wisdom the twenty high peaks of the mountain of views concerning the transitory collection, and manifested the resultant state of stream entry right where they sat.

source: ཁྱིམ་བདག་དེས་བདེན་པ་མཐོང་ནསསྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: After seeing the truths, they rose from their seats, drew down the right shoulder of their upper garments, bowed toward the Blessed One with palms pressed together, and said to the Blessed One,

source: བཅོམ་ལྡན་འདས་ལ་བརྟེན་ནས་བདག་སེམས་ཅན་དམྱལ་བ་དང་དུད་འགྲོ་དང་ཡི་དགས་རྣམས་ལས་ནི་ཕྱུང་།
en: “Because of you, Blessed One, we have been lifted up from among the hell beings, animals, and anguished spirits.

source: ལྷ་དང་མིའི་ནང་དུ་ནི་གོམ་པ་འདོར་དུ་སྩལ། ཁྲག་དང་མཆི་མའི་རྒྱ་མཚོ་རྣམས་ནི་བསྐམས། རུས་པའི་རི་རྣམས་ནི་བསྒྲལ། ངན་སོང་གི་སྒོ་རྣམས་ནི་བཅད་མཐོ་རིས་དང་ཐར་པའི་སྒོ་རྣམས་ནི་ཕྱེ།
en: Leading us to live among the gods and humans, you have dried up the ocean of blood and tears, led us over the mountain pass of bones, slammed shut the doors to lower births, and swung wide open the doors to the god realms and liberation.

source: ཡུན་རིང་པོ་ནས་གོམས་པའི་ཉོན་མོངས་པ་རྣམས་ནི་མཐར་གཏུགས་ཏེ། ཞི་བ་དང་སྤངས་པ་དང་བོར་བར་གྱུར་ལགས་སོ། །
en: You have brought to an end the afflictive emotions to which we have been accustomed since beginningless time, pacifying them, tossing them aside, and casting them away.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ཇི་སྲིད་འཚོའི་བར་དུ་དགེ་སློང་གི་དགེ་འདུན་དང་ལྷན་ཅིག་ཏུ་བདག་ལས་ན་བཟའ་དང་ཞལ་ཟས་དང་གཟིམས་ཆ་དང་གདན་དང་སྙུན་གསོས་དང་སྨན་ཟོང་རྣམས་བཞེས་པར་གནང་བར་མཛད་དུ་གསོལ།
en: Blessed One, for as long as we live, may you and the rest of the saṅgha of monks please accept from us your provisions of clothing, food, bedding, seats, and medicines for the sick.”

source: བཀའ་སྩལ་པ། ཁྱིམ་བདག་གཞན་དག་གི་དོན་ཡང་བྱ་དགོས་ཀྱིས་ཐོང་ཤིག་ཅེས་བཀའ་སྩལ་པ། བཅོམ་ལྡན་འདས་སླར་གཤེགས་སོ། །
en: The Blessed One replied, “Householder, please relent—there are others who also need my help,” and departed.

source: བཅོམ་ལྡན་འདས་སླར་གཤེགས་ནས་ཁྱིམ་བདག་གི་བུས་བསམས་པ།
en: After the Blessed One had departed, the householder’s sons thought,

source: བདག་གིས་ཁྱིམ་ན་གནས་པ་བཏང་ལ་རབ་ཏུ་བྱུང་ངོ་སྙམ་ནས་ཕ་མ་ལ་བཟླུགས་ཏེ།
en: “We will give up living at home to go forth.” They asked for their parents’ permission and went to see the Blessed One.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Upon their arrival they touched their heads to the Blessed One’s feet, drew down the right shoulder of their upper garments, bowed toward the Blessed One with palms pressed together, and made this request of the Blessed One,

source: དེས་ཀྱང་བརྩོན་པ་དང་བསྒྲུབ་པ་དང་འབད་པས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་ཏེ་
en: Casting away all afflictive emotions through diligence, practice, and effort, they manifested arhatship.

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་ཁྱིམ་བདག་འདིའི་བུ་དྲུག་ལྟ་བ་དུ་མ་འཚལ་ཏེ། ཕན་ཚུན་མི་འཐུན་པར་སྨྲ་བ་ལས་ནུ་བོ་ཐ་ཆུངས་ཀྱིས་ལྟ་བ་གཅིག་ཏུ་འཐུན་པ་ལ་བཀོད་ནས། དེ་དག་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བགྱིས་པ་ལ་གཟིགས་ལགས།
en: “Lord,” the monks requested the Blessed Buddha, “tell us why six of the householder’s seven children had divergent views and could not agree with each other until the youngest brother brought them around to a single view and they all went forth in the doctrine of the Blessed One, cast away all afflictive emotions, and manifested arhatship.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ད་ལྟར་འབའ་ཞིག་མ་ཡིན་ཏེཇི་ལྟར་འདས་པའི་དུས་ན་ཡང་སྤུན་དྲུག་པོ་འདི་རྣམས་ཕན་ཚུན་མི་འཐུན་པ་ལས། ནུ་བོ་ཐ་ཆུངས་འདི་ཁོ་ནས་གཅིག་ཏུ་འཐུན་པ་ལ་བཀོད་ནས། དེ་རྣམས་ཀྱང་དྲང་སྲོང་ལ་རབ་ཏུ་ཕྱུང་སྟེ། བསམ་གཏན་བཞི་དང་མངོན་པར་ཤེས་པ་ལྔ་བསྐྱེད་པ་དེ་ཉོན་ཅིག །
en: “Not only now,” the Blessed One explained, “but in times past as well, and in the same way, the other six brothers could not come to an agreement until the youngest brother alone brought them into agreement and all of them went forth in the presence of a sage and generated the four meditative states and five superknowledges. Listen well!

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་ཡུལ་དབུས་ཀྱི་རྒྱལ་པོ་བདུན་རང་རང་གི་ཡུལ་ན་རྒྱལ་པོ་བྱེད་པ་ལས།
en: “Monks, in times gone by, the seven kings of the central country each reigned in their own lands.

source: དེ་རྣམས་ཕན་ཚུན་མི་འཐུན་ཏེ་དུས་དུས་སུ་སྐྱེ་བོ་མང་པོ་ཁ་འདོག་པར་བྱེད་དོ། །
en: None of them was friendly with the others, and from time to time a great many people were killed.

source: དེ་ནས་ཕྱི་ཞིག་ན་ཡུལ་ཀཱ་ཤིའི་རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱི་བློ་སྐྱེས་པ།
en: One day King Brahmadatta of Kāśi thought,

source: བདག་གིས་ཉི་འོག་གི་རྒྱལ་པོ་འདི་དག་ཐམས་ཅད་ཐབས་ཅི་ཞིག་གིས་བསྡུམ་པར་བྱ་སྙམ་མོ། །
en: ‘How can I restore relations among the kings of these neighboring lands?’

source: དེའི་ཚེ་ཡུལ་ཀཱ་ཤིའི་རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱི་ཡུལ་ན་དཀའ་ཐུབ་ཀྱི་གནས་ཞིག་ན། དྲང་སྲོང་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པ་རྫུ་འཕྲུལ་ཆེ་ཞིང་མཐུ་ཆེ་བ་ཞིག་གནས་སོ། །
en: “At that time in the land of Brahmadatta, king of Kāśi, there was a sage living in a certain hermitage who had all five superknowledges, a person of great miracles and great power.

source: དེ་ནས་རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱིས་བསམས་པ།
en: King Brahmadatta thought,

source: བདག་གིས་དྲང་སྲོང་དེ་ལ་བཅོལ་ན། དེས་འདི་རྣམས་ཀྱི་བསྡུམས་བྱེད་ནུས་པར་འགྱུར་རོ་སྙམ་ནས།
en: ‘If I call upon that sage, he can restore relations between them.’

source: དྲང་སྲོང་དེ་ག་ལ་འདུག་པ་དེར་སོང་སྟེ་རྐང་པ་ལ་ཕྱག་འཚལ་ནས་སྨྲས་པ།
en: He went to see the sage, bowed down at his feet, and said,

source: ཉི་འོག་གི་རྒྱལ་པོ་དྲུག་པོ་འདི་དག་ཐམས་ཅད་ནི་ཕན་ཚུན་མི་འཐུན་ཏེ། དུས་དུས་སུ་སྐྱེ་བོ་མང་པོ་ཁ་འདོག་པར་བྱེད་དོ། །
en: ‘The six neighboring kings are not friendly with one another, and from time to time a great many people are killed.

source: དེ་བས་ན་ཁྱོད་ཀྱིས་ཐམས་ཅད་བསྡུམ་པར་རིགས་སོ་ཞེས་བྱས་སོ། །
en: It would be right of you to restore relations between them.’

source: དེ་ནས་དྲང་སྲོང་དེས་ཀཱ་ཤིའི་རྒྱལ་པོ་ཚངས་པས་བྱིན་ལ་ཅང་མི་སྨྲ་བས་གནང་ངོ་། །
en: The sage assented to King Brahmadatta by his silence.

source: དེ་ནས་ཀཱ་ཤིའི་རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱིས། དྲང་སྲོང་དེས་ཅང་མི་སྨྲ་བས་གནང་བར་རིག་ནས་རྐང་པ་ལ་ཕྱག་འཚལ་ཏེ་སོང་ངོ་། །
en: Understanding that by his silence the sage had given his assent, King Brahmadatta bowed down at his feet and departed.

source: དེ་ནས་ཕྱི་ཞིག་ན་རྒྱལ་པོ་དྲུག་པོ་རྣམས་ཀྱིས་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་གོ་བསྐོན་ཏེ། ཡུལ་བཱ་རཱ་ཎ་སཱིར་ལྷགས་ནས།
en: “One day the six kings arrayed all four divisions of their armies and advanced on Vārāṇasī.

source: གྲོང་ཁྱེར་ཐམས་ཅད་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་གོ་བསྐོན་ནས་བསྐོར་ཏེ་འཁོད་དོ། །
en: With the four divisions of their armies all arrayed, they completely surrounded the city in siege,

source: དེ་ནས་ཀཱ་ཤིའི་རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱིས་དྲང་སྲོང་དེ་ལ་སྦྲན་ཏེ།
en: whereupon Brahmadatta, king of Kāśi, sent word to the sage.

source: དེ་ཐོས་མ་ཐག་ཏུ་དྲང་སྲོང་དེ་གནས་དེ་ཁོ་ན་ནས་རྒྱལ་པོ་དྲུག་པོ་གང་ན་འཁོད་པ་དེར་ནམ་མཁའ་ལ་སོང་ངོ་། །
en: As soon as he heard, the sage traveled through the sky from his dwelling to the very place where the six kings were encamped.

source: དེ་ནས་དེ་མཐོང་མ་ཐག་ཏུ་རྒྱལ་རིགས་ཀྱི་རྒྱལ་པོ་དྲུག་པོ་དེ་རྣམས་དྲང་སྲོང་དེ་ལ་ཤིན་ཏུ་དགའ་བར་གྱུར་ཏོ། །
en: “Upon seeing the sage, all six kṣatriya kings were immediately overcome with joy toward him.

source: དགའ་བར་གྱུར་ནས་དྲང་སྲོང་ག་ལ་བ་དེར་དོང་སྟེ། ལྷགས་ནས་རྐང་པ་ལ་ཕྱག་འཚལ་ཏེ་ཆོས་མཉན་པའི་ཕྱིར་མདུན་དུ་འཁོད་དོ། །
en: In their joy they went to see the sage, and upon their arrival they bowed down at his feet and sat before him to listen to the Dharma.

source: དེ་ནས་དྲང་སྲོང་དེས་དེ་དག་ལ་ཆོས་བསྟན་ནས་ཐམས་ཅད་མཇལ་དུམ་བྱེད་དུ་བཅུག་གོ། །
en: After he taught them the Dharma, the sage got them all to form a truce.

source: དེ་དག་གིས་མཇལ་དུམ་བྱས་ནས་དྲང་སྲོང་དེ་ཉིད་ཀྱི་ཐད་དུ་རབ་ཏུ་འབྱུང་བར་འདོད་པའི་སེམས་སྐྱེས་སོ། །
en: After having made a truce, they resolved to go forth in the presence of the sage.

source: དེ་ནས་དེ་དག་གིས་གཅིག་ལ་གཅིག་བཟླུགས་ནས་ཡུལ་ཡུལ་དུ་དོང་སྟེ།
en: Each informed the other of his intention and traveled back to his own land.

source: རང་རང་གི་བུ་རྒྱལ་པོར་བཅུག་ནས་སྦྱིན་པ་དག་བྱིན་ཞིང་བསོད་ནམས་དག་བྱས་ནས། དྲང་སྲོང་དེ་ཉིད་ཀྱི་ཐད་དུ་རབ་ཏུ་བྱུང་ངོ་། །
en: After each had abdicated in favor of his son, given gifts, and made merit, they all went forth in the presence of that sage.

source: དེའི་ཚེ་རྒྱལ་པོ་དྲུག་པོ་ཕན་ཚུན་མི་འཐུན་པར་གྱུར་པ་གང་ཡིན་པ་དེ་དག་ནི་སྤུན་དྲུག་པོ་ཕན་ཚུན་མི་འཐུན་པར་སྨྲ་བར་གྱུར་པ་འདི་དག་ཁོ་ན་ཡིན་ནོ། །
en: The six kings who disagreed with each other then are none other than the six brothers who could not come to an agreement now.

source: དེའི་ཚེ་རྒྱལ་པོ་ཚངས་པས་བྱིན་ཞེས་བྱ་བར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་ནུ་བོ་ཐ་ཆུངས་འདི་ཁོ་ན་ཡིན་ཏེ།
en: The one who was King Brahmadatta then is none other than the youngest son himself.

source: དེའི་ཚེ་ཡང་དྲང་སྲོང་དེས་ཕན་ཚུན་མི་འཐུན་པ་དེ་དག་བསྡུམས་ནས་དེ་དག་ཀྱང་རབ་ཏུ་བྱུང་སྟེ། བསམ་གཏན་བཞི་དང་མངོན་པར་ཤེས་པ་ལྔ་བསྐྱེད་དོ། །
en: At that time the sage brought them into agreement and they went forth before him, generating the four meditative states and five superknowledges.

source: ད་ལྟར་ཡང་འདིས་སྤུན་དྲུག་པོ་ཕན་ཚུན་ལྟ་བ་མི་འཐུན་པར་སྨྲ་བ་རྣམས་ལྟ་བ་གཅིག་ཏུ་འཐུན་པར་བྱས་ཏེ། དེ་དག་ཀྱང་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ། །
en: Six of the brothers had divergent views, were brought around to a single view, went forth, cast away all afflictive emotions, and manifested arhatship.”

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ། བཙུན་པ་ཁྱིམ་བདག་བུ་དང་གཡོག་འཁོར་དུ་བཅས་པ་འདིས་ལས་ཅི་བགྱིས་ན། ལས་དེའི་རྣམ་པར་སྨིན་པས་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་ལ།
en: “Lord,” the monks asked the Blessed One, “what action did the householder, his sons, and their servants take that ripened into their births into a family of great means, prosperity, and wealth;

source: བཅོམ་ལྡན་འདས་ཀྱང་འདི་རྣམས་ཀྱིས་མཉེས་པར་བགྱིས་ཏེ། མི་མཉེས་པར་མ་བགྱིས་བུ་བདུན་ཡང་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བགྱིས་ལགས།
en: that they pleased and did not displease the Blessed One; and that they went forth in the doctrine of the Blessed One, cast away all afflictive emotions, and manifested arhatship?”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་འདི་རྣམས་ཀྱིས་གང་དུ་སྨོན་ལམ་བཏབ་ལགས།
en: “When did they make these prayers?” they asked.

source: བཀའ་སྩལ་པ། དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་སྐྱེ་དགུའི་ཚེ་ལོ་ཉི་ཁྲི་ཐུབ་པ་ན། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་གདུལ་བྱའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་སྲུང་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ
en: “Monks,” the Blessed One recounted, “in times past, in this fortunate eon, when people lived as long as twenty thousand years, and the totally and completely awakened buddha possessed of insight and perfect conduct, the sugata, the knower of the world, the tamer of persons, the charioteer, the unsurpassed one, the teacher of humans and gods, the blessed buddha known as Kāśyapa was in the world,

source: དེའི་ཚེ་བཱ་རཱ་ཎ་སཱི་ན། ཁྱིམ་བདག་ཅིག་གནས་པ་དེའི་བུ་སྤུན་དྲུག་ཕན་ཚུན་ལྟ་བ་མི་འཐུན་པར་སྨྲ་བར་གྱུར་ཏོ། །
en: there was a householder in Vārāṇasī with six older sons who had divergent views and could not come to an agreement.

source: ཁྱིམ་བདག་དེའི་བུ་ཐ་ཆུངས་ནི་སངས་རྒྱས་ལ་དགའ་སྟེ།
en: “The youngest of the sons delighted in the Buddha.

source: དེས་ཕུ་བོ་ཐམས་ཅད་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་བཙུད་ནས།
en: He led his six older brothers to the doctrine of the totally and completely awakened Buddha Kāśyapa.

source: དེ་དག་ཐམས་ཅད་ཀྱིས་ཕ་མ་ལ་གསོལ་ཏེ། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་གསུང་རབ་ལ་རབ་ཏུ་བྱུང་ནས། དེ་དག་གིས་དེར་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ནས་
en: All of them asked for their parents’ permission, went forth in the doctrine of the totally and completely awakened Buddha Kāśyapa, and practiced pure conduct all their lives.

source: ཁྱིམ་བདག་དེས་ཀྱང་སྦྱིན་པ་དག་བྱིན་ཞིང་བསོད་ནམས་དག་བྱས་ནས། ཚེ་གཅིག་ཏུ་སྐྱབས་སུ་འགྲོ་བ་དང་བསླབ་པའི་གཞི་རྣམས་བསྲུངས་ནས་འཆི་ཀར་སྨོན་ལམ་བཏབ་པ།
en: “The householder also gave gifts and made merit, went for refuge, and maintained the fundamental precepts all his life. At the time of his death, he prayed,

source: དགེ་བའི་རྩ་བ་འདིས་ན་བདག་གང་དང་གང་དུ་སྐྱེ་བར་འགྱུར་བ་དེ་དང་དེར་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེ་བར་གྱུར་ཅིག །
en: ‘By this root of virtue, wherever I am born, may it be into a family of great means, prosperity, and wealth.

source: དེའི་ཚེ་ཡང་བུ་བདུན་པོ་འདི་དག་ཉིད་བདག་གི་བུར་གྱུར་ཅིག །
en: At that time may these same seven children be my children.

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས། བྲམ་ཟེའི་ཁྱེའུ་བླ་མ་ལུང་བསྟན་པ་གང་ཡིན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་བདག་གིས་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག །མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: May I please and not displease Uttara, the young brahmin prophesied by the totally and completely awakened Buddha Kāśyapa to be the next blessed buddha.’

source: དེའི་ཚེ་ཁྱིམ་བདག་ཏུ་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་ཁྱིམ་བདག་འདི་ཁོ་ན་ཡིན་ཏེ།
en: The one who was that householder then is none other than this householder.

source: དེས་དེར་སྦྱིན་པ་དག་བྱིན་ཅིང་བསོད་ནམས་དག་བྱས་ནས། སྐྱབས་སུ་འགྲོ་བ་དང་བསླབ་པའི་གཞི་རྣམས་བསྲུངས་ཏེ་འཆི་ཀར་སྨོན་ལམ་བཏབ་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས། གང་དང་གང་དུ་སྐྱེས་པ་དེ་དང་དེར་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་ནས
en: The acts of giving gifts and making merit, taking refuge and maintaining the fundamental precepts, and praying at the time of his death ripened such that wherever he was born, it was into a family of great means, prosperity, and wealth;

source: འདིས་ང་མཉེས་པར་བྱས་ཏེ་མི་མཉེས་པར་མ་བྱས་ལ། འདི་དག་ཀྱང་འདིའི་བུ་ཁོ་ནར་གྱུར་ཏོ། །
en: that he has pleased me and not displeased me; and that they alone were his sons.

source: བུ་འདི་རྣམས་ཀྱིས་ཀྱང་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ནས་འཆི་ཀར་སྨོན་ལམ་བཏབ་པ་དེས་ན།
en: The sons also practiced the conduct that leads to enlightenment all their lives, and prayed at the time of their deaths.

source: དགེ་སློང་དག་ང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་དང་ཤིན་ཏུ་མཉམ་པ་དང་། ཤུགས་མཉམ་པ་དང་། མཛད་པ་མཉམ་པ་དང་། ཐབས་མཉམ་པ་བརྙེས་པར་གྱུར་ནས་འདི་རྣམས་ཀྱིས་ང་མཉེས་པར་བྱས་ཏེམི་མཉེས་པར་མ་བྱས་ལ་ང་ཉིད་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ།། །།
en: “So it is, monks, now that I myself have become the very equal of the totally and completely awakened Buddha Kāśyapa—equal in strength, equal in deeds, and equal in skillful means—that they have pleased me, not displeased me, gone forth in my very doctrine, cast away all afflictive emotions, and manifested arhatship.”

source: འོད་སྲུང་ཞེས་བྱ་བ་ནི།
en: A Story about Kāśyapa

source: གླེང་གཞི་རྒྱལ་པོའི་ཁབ་ན་བཞུགས་སོ། །
en: Once, when the Blessed One was in Rājagṛha,

source: དེ་ནས་ཕྱི་ཞིག་ན་ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོ་དགོན་པའི་གནས་མལ་ཞིག་ཏུ་ཡུན་རིང་དུ་ལོན་ཏེ།
en: Venerable Mahā­kāśyapa had spent a long time in a retreat hermitage.

source: སྐྲ་དང་ཁ་སྤུ་རིང་ཞིང་གོས་རྙིངས་པར་གྱུར་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་ངོ་། །
en: After the hair on his head and face had grown long and his clothes were worn out, he went to see the Blessed One.

source: དེའི་ཚེ་བཅོམ་ལྡན་འདས་འཁོར་བརྒྱ་ཕྲག་དུ་མའི་གུང་ལ་བཞུགས་ཏེ། དགེ་སློང་གི་དགེ་འདུན་ལ་ཆོས་སྟོན་ཏོ། །
en: At that time the Blessed One sat amid a company of hundreds teaching the Dharma to the saṅgha of monks.

source: དེ་ནས་དགེ་སློང་དེ་དག་གིས་ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོ་ཐག་རིང་པོ་ཞིག་ནས་མཐོང་ནས།
en: The monks saw Venerable Mahā­kāśyapa from a distance and felt contempt for him.

source: ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོ་ལ་བརྙས་པའི་སེམས་སྐྱེས་ཏེ།
en: They thought,

source: ཚེ་དང་ལྡན་པ་དགེ་སློང་སྐྲ་དང་ཁ་སྤུ་རིང་ཞིང་གོས་ངན་ལ་མ་བརྟགས་པའི་ཆ་ལུགས་ཅན་འདི་ག་ལས་འོངས་ཞིག་གུ་སྙམ་མོ། །
en: “An person who has gone forth—a monk—with long hair on his head and face, and so carelessly dressed, in such shoddy clothing! Where does he come from?”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས། དགེ་སློང་དེ་དག་གི་བསམ་པ་ཐུགས་ཀྱིས་མཁྱེན་ནས།
en: The Blessed One directly apprehended their thoughts and reflected,

source: དགེ་སློང་འོད་སྲུང་འདི་ནི་ང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་འོག་ཏུ། ངའི་བསྟན་པའི་དོན་བྱེད་པར་འགྱུར་ཏེ།
en: “After my parinirvāṇa, the monk Kāśyapa will fulfill the purpose of my teaching.

source: མདོ་སྡེ་དང་ཆོས་མངོན་པ་དང་འདུལ་བ་ཡང་དག་པར་སྡུད་པར་འགྱུར་བ་ཡིན་ལ། དགེ་སློང་འདི་རྣམས་ཀྱིས་ནི་འདི་ལ་ཤིན་ཏུ་བརྙས་པའི་སེམས་བསྐྱེད་ཀྱིས།
en: He will recount the Sūtras, Abhidharma, and Vinaya, yet these monks feel such contempt for him.

source: མ་ལ་ངས་འདི་རྣམས་ལ་གྱོད་གདབ་པར་བྱའོ། །
en: I must settle this objection for them,

source: འོན་ཀྱང་འདི་ལྷ་དང་མི་དང་བཅས་པའི་འཇིག་རྟེན་གྱིས་མཆོད་ཅིང་རྗེད་པ་དང་གུས་པར་སྨྲ་བའི་གནས་སུ་འགྱུར་རོ་སྙམ་དུ་དགོངས་ནས།
en: for he will become a worthy object of worship and reverence, and be spoken of with respect by all the world with its gods and humans.”

source: དེར་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ།
en: The Blessed One addressed the monks, saying,

source: དགེ་སློང་ཁྱེད་ཀྱིས་དགེ་སློང་འདི་ལ་ཤིན་ཏུ་བརྙས་པའི་སེམས་མ་སྐྱེད་ཅིག །
en: “Monks, you should not feel such contempt for this monk.

source: འདི་ནི་ང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་འོག་ཏུ་ངའི་བསྟན་པའི་དོན་བྱེད་པར་འགྱུར་ཏེ།
en: After my parinirvāṇa he will recount my teaching.

source: སྡེ་སྣོད་གསུམ་ཡང་དག་པར་སྡུད་པར་བྱེད་ཅིང་། ཆོས་ཀྱི་ཚུལ་འཕེལ་བར་བྱེད་དོ་ཞེས་གསུངས་སོ། །
en: He will perfectly recount the Tripiṭaka and propagate the way of the Dharma.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས། ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོ་ལ་བཀའ་སྩལ་པ།
en: Then the Blessed One addressed Venerable Mahā­kāśyapa,

source: འོད་སྲུང་ཚུར་ཤོག་འོད་སྲུང་འོངས་པ་ལེགས་སོ། །
en: “ Kāśyapa , come along! Welcome, Kāśyapa !

source: སྟན་ཕྱེད་འདི་ལ་འདུག་ཤིག །
en: Share this seat with me.

source: བདག་ཅག་གཉིས་ལས་ཁྱོད་སྔར་རབ་ཏུ་བྱུང་ངམ། ང་སྔར་རབ་ཏུ་བྱུང་བ་བརྟག་གོ་ཞེས་བཀའ་སྩལ་ཏོ། །
en: Let us examine which of us first went forth—you or me?”

source: དེ་ནས་དགེ་སློང་དེ་དག་འཇིགས་ཤིང་སྐྲག་ལ་འགྱོད་དེ་སྐྱི་བུང་ཞེས་བྱེད་ནས།
en: All the monks felt horrible regret and their hair stood on end.

source: ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོ་དེ་ལྟར་རྫུ་འཕྲུལ་ཆེ་ཞིང་མཐུ་ཆེ་སྟེ།
en: “Venerable Mahā­kāśyapa has such great miraculous powers,” they said.

source: ད་སྟོན་པས་ཉན་ཐོས་ལ་གདན་གྱི་ཕྱེད་བསྟབས་པ་ནི་ངོ་མཚར་ཏོ་སྙམ་མོ། །
en: “How wonderful that our teacher is sharing a seat with his disciple.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོས་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then Venerable Mahā­kāśyapa drew down the right shoulder of his upper garment, knelt down on his right knee, bowed toward the Blessed One with palms pressed together, and said,

source: བཅོམ་ལྡན་འདས་ནི་བདག་གི་སྟོན་པ་ལགས།
en: “Blessed One, you are my teacher.

source: བདག་ནི་བཅོམ་ལྡན་འདས་ཀྱི་ཉན་ཐོས་ལགས་སོ། །
en: I am a disciple of the Blessed One.

source: བདེ་བར་གཤེགས་པ་ནི་བདག་གི་སྟོན་པ་ལགས།
en: The Sugata is my teacher.

source: བདག་ནི་བདེ་བར་གཤེགས་པའི་ཉན་ཐོས་ལགས་སོ། །
en: I am a disciple of the Sugata.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འོད་སྲུང་དེ་ནི་དེ་བཞིན་ནོ། །
en: “ Kāśyapa , so it is,” the Blessed One replied.

source: ང་ནི་འོད་སྲུང་ཁྱོད་ཀྱི་སྟོན་པ་ཡིན།
en: I am your teacher, Kāśyapa .

source: ཁྱོད་ནི་ངའི་ཉན་ཐོས་ཡིན་ནོ། །
en: You are my disciple.

source: འོད་སྲུང་ཁྱོད་བདག་གི་སྟན་གང་ཡིན་པ་ལ་འདུག་ཤིག །
en: Kāśyapa , wherever my seat may be, you shall sit upon it.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ། །
en: Venerable Mahā­kāśyapa touched his head to the Blessed One’s feet and took a seat at one side.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ལྷག་པར་ཡང་སྐྱོ་བ་བསྐྱེད་པར་བཞེད་པ་དང་། ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོ་ཆོས་ཀྱིས་ཐོབ་པའི་ཆེ་བ་དང་རྒྱ་ཆེ་བ་ལ་གཞག་པར་བཞེད་ནས། དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ།
en: The Blessed One wished to make the monks greatly disillusioned with saṃsāra and to affirm Venerable Mahā­kāśyapa’s greatness in the Dharma, so he said to the monks,

source: དགེ་སློང་དག་ང་ནི་གལ་ཏེ་འདོད་པ་དག་ལས་དབེན་པ་སྡིག་པ་མི་དགེ་བའི་ཆོས་རྣམས་ལས་དབེན་པ། །རྟོག་པ་དང་བཅས་དཔྱོད་པ་དང་བཅས་པ། དབེན་པ་ལས་སྐྱེས་པའི་དགའ་བ་དང་བདེ་བ་ཅན་བསམ་གཏན་དང་པོ་རྫོགས་པར་བྱས་ཏེ་གནས་པར་འདོད་ན་ཡང་།
en: “Monks, should I wish to remain in the perfected state of the first concentration, which is secluded from craving, secluded from sinful and nonvirtuous factors, accompanied by initial consideration and subsequent analysis, and imbued with the joy and pleasure born of seclusion,

source: ང་ནི་གནས་དེས་ཉིན་གཅིག་གམ། མཚན་གཅིག་གམ་ཉིན་ཞག་གཅིག་གམ་གཉིས་སམ་གསུམ་འམ་ཉིན་ཞག་བདུན་གྱི་བར་དུ་ཡང་གནས་སོ། །
en: I could remain in that state throughout the day, or throughout the night, or throughout a day and night, or for even two, three, or seven such days and nights.

source: དགེ་སློང་དག་དགེ་སློང་འོད་སྲུང་ཡང་གལ་ཏེ། འདོད་པ་དག་ལས་དབེན་པ་སྡིག་པ་མི་དགེ་བའི་ཆོས་རྣམས་ལས་དབེན་པ་རྟོག་པ་དང་བཅས་པ་དཔྱོད་པ་དང་བཅས་པ། དབེན་པ་ལས་སྐྱེས་པའི་དགའ་བ་དང་བདེ་བ་ཅན་བསམ་གཏན་དང་པོ་རྫོགས་པར་བྱས་ཏེགནས་པར་འདོད་ན་ ཡང་།
en: “Monks, should the monk Kāśyapa wish to remain in the perfected state of the first concentration, which is secluded from craving, secluded from sinful and nonvirtuous factors, accompanied by initial consideration and subsequent analysis, and imbued with the joy and pleasure born of seclusion,

source: དགེ་སློང་འོད་སྲུང་ཡང་གནས་དེས་ཉིན་གཅིག་གམ་མཚན་གཅིག་གམ་ཉིན་ཞག་གཅིག་གམ་གཉིས་སམ་གསུམ་འམ་ཉིན་ཞག་བདུན་གྱི་བར་དུ་ཡང་གནས་སོ། །
en: the monk Kāśyapa too could remain in that state for a day, or a night, or a day and night, or even two, three, or seven such days.

source: དགེ་སློང་དག་ང་ནི་གལ་ཏེ་རྟོག་པ་དང་དཔྱོད་པ་དང་བྲལ་ཞིང་ནང་ཡོངས་སུ་དང་སྟེ། སེམས་ཀྱི་རྒྱུད་གཅིག་ཏུ་གྱུར་པས། རྟོག་པ་མེད་པ་དཔྱོད་པ་མེད་པ་ཏིང་ངེ་འཛིན་ལས་སྐྱེས་པའི་དགའ་བ་དང་བདེ་བ་ཅན་བསམ་གཏན་གཉིས་པ་རྫོགས་པར་བྱས་ཏེ། གནས་པར་འདོད་ན་ཡང་
en: “Monks, should I wish to be free of initial consideration and subsequent analysis, inwardly serene, with single-pointed focus, and thereby abide in the perfected state of the second concentration, which is without initial consideration and subsequent analysis, and imbued with the joy and pleasure born of meditative stabilization ,

source: གནས་དེས་ཉིན་གཅིག་གམ་མཚན་གཅིག་གམ་ཉིན་ཞག་གཅིག་གམ་གཉིས་སམ་གསུམ་འམ་ཉིན་ཞག་བདུན་གྱི་བར་དུ་ཡང་གནས་སོ། །
en: I could remain in that state for a day, or a night, or a day and night, or even two, three, or seven such days.
